// 0. Вывести квадрат числа
Console.WriteLine("Введите число, которое нужно возвести в квадрат");
string ss = Console.ReadLine();
int number = int.Parse(ss);
Console.WriteLine(number * number);
